// region 前台模拟数据
/*var geoCoordMap = {
  "海门": [121.15, 31.89],
  "鄂尔多斯": [109.781327, 39.608266],
  "招远": [120.38, 37.35],
  "舟山": [122.207216, 29.985295],
  "齐齐哈尔": [123.97, 47.33],
  "盐城": [120.13, 33.38],
  "赤峰": [118.87, 42.28],
  "青岛": [120.33, 36.07],
  "乳山": [121.52, 36.89],
  "金昌": [102.188043, 38.520089],
  "泉州": [118.58, 24.93],
  "莱西": [120.53, 36.86],
  "日照": [119.46, 35.42],
  "胶南": [119.97, 35.88],
  "南通": [121.05, 32.08],
  "拉萨": [91.11, 29.97],
  "云浮": [112.02, 22.93],
  "梅州": [116.1, 24.55],
  "文登": [122.05, 37.2],
  "上海": [121.48, 31.22],
  "攀枝花": [101.718637, 26.582347],
  "威海": [122.1, 37.5],
  "承德": [117.93, 40.97],
  "厦门": [118.1, 24.46],
  "汕尾": [115.375279, 22.786211],
  "潮州": [116.63, 23.68],
  "丹东": [124.37, 40.13],
  "太仓": [121.1, 31.45],
  "曲靖": [103.79, 25.51],
  "烟台": [121.39, 37.52],
  "福州": [119.3, 26.08],
  "瓦房店": [121.979603, 39.627114],
  "即墨": [120.45, 36.38],
  "抚顺": [123.97, 41.97],
  "玉溪": [102.52, 24.35],
  "张家口": [114.87, 40.82],
  "阳泉": [113.57, 37.85],
  "莱州": [119.942327, 37.177017],
  "湖州": [120.1, 30.86],
  "汕头": [116.69, 23.39],
  "昆山": [120.95, 31.39],
  "宁波": [121.56, 29.86],
  "湛江": [110.359377, 21.270708],
  "揭阳": [116.35, 23.55],
  "荣成": [122.41, 37.16],
  "连云港": [119.16, 34.59],
  "葫芦岛": [120.836932, 40.711052],
  "常熟": [120.74, 31.64],
  "东莞": [113.75, 23.04],
  "河源": [114.68, 23.73],
  "淮安": [119.15, 33.5],
  "泰州": [119.9, 32.49],
  "南宁": [108.33, 22.84],
  "营口": [122.18, 40.65],
  "惠州": [114.4, 23.09],
  "江阴": [120.26, 31.91],
  "蓬莱": [120.75, 37.8],
  "韶关": [113.62, 24.84],
  "嘉峪关": [98.289152, 39.77313],
  "广州": [113.23, 23.16],
  "延安": [109.47, 36.6],
  "太原": [112.53, 37.87],
  "清远": [113.01, 23.7],
  "中山": [113.38, 22.52],
  "昆明": [102.73, 25.04],
  "寿光": [118.73, 36.86],
  "盘锦": [122.070714, 41.119997],
  "长治": [113.08, 36.18],
  "深圳": [114.07, 22.62],
  "珠海": [113.52, 22.3],
  "宿迁": [118.3, 33.96],
  "咸阳": [108.72, 34.36],
  "铜川": [109.11, 35.09],
  "平度": [119.97, 36.77],
  "佛山": [113.11, 23.05],
  "海口": [110.35, 20.02],
  "江门": [113.06, 22.61],
  "章丘": [117.53, 36.72],
  "肇庆": [112.44, 23.05],
  "大连": [121.62, 38.92],
  "临汾": [111.5, 36.08],
  "吴江": [120.63, 31.16],
  "石嘴山": [106.39, 39.04],
  "沈阳": [123.38, 41.8],
  "苏州": [120.62, 31.32],
  "茂名": [110.88, 21.68],
  "嘉兴": [120.76, 30.77],
  "长春": [125.35, 43.88],
  "胶州": [120.03336, 36.264622],
  "银川": [106.27, 38.47],
  "张家港": [120.555821, 31.875428],
  "三门峡": [111.19, 34.76],
  "锦州": [121.15, 41.13],
  "南昌": [115.89, 28.68],
  "柳州": [109.4, 24.33],
  "三亚": [109.511909, 18.252847],
  "自贡": [104.778442, 29.33903],
  "吉林": [126.57, 43.87],
  "阳江": [111.95, 21.85],
  "泸州": [105.39, 28.91],
  "西宁": [101.74, 36.56],
  "宜宾": [104.56, 29.77],
  "呼和浩特": [111.65, 40.82],
  "成都": [104.06, 30.67],
  "大同": [113.3, 40.12],
  "镇江": [119.44, 32.2],
  "桂林": [110.28, 25.29],
  "张家界": [110.479191, 29.117096],
  "宜兴": [119.82, 31.36],
  "北海": [109.12, 21.49],
  "西安": [108.95, 34.27],
  "金坛": [119.56, 31.74],
  "东营": [118.49, 37.46],
  "牡丹江": [129.58, 44.6],
  "遵义": [106.9, 27.7],
  "绍兴": [120.58, 30.01],
  "扬州": [119.42, 32.39],
  "常州": [119.95, 31.79],
  "潍坊": [119.1, 36.62],
  "重庆": [106.54, 29.59],
  "台州": [121.420757, 28.656386],
  "南京": [118.78, 32.04],
  "滨州": [118.03, 37.36],
  "贵阳": [106.71, 26.57],
  "无锡": [120.29, 31.59],
  "本溪": [123.73, 41.3],
  "克拉玛依": [84.77, 45.59],
  "渭南": [109.5, 34.52],
  "马鞍山": [118.48, 31.56],
  "宝鸡": [107.15, 34.38],
  "焦作": [113.21, 35.24],
  "句容": [119.16, 31.95],
  "北京": [116.46, 39.92],
  "徐州": [117.2, 34.26],
  "衡水": [115.72, 37.72],
  "包头": [110, 40.58],
  "绵阳": [104.73, 31.48],
  "乌鲁木齐": [87.68, 43.77],
  "枣庄": [117.57, 34.86],
  "杭州": [120.19, 30.26],
  "淄博": [118.05, 36.78],
  "鞍山": [122.85, 41.12],
  "溧阳": [119.48, 31.43],
  "库尔勒": [86.06, 41.68],
  "安阳": [114.35, 36.1],
  "开封": [114.35, 34.79],
  "济南": [117, 36.65],
  "德阳": [104.37, 31.13],
  "温州": [120.65, 28.01],
  "九江": [115.97, 29.71],
  "邯郸": [114.47, 36.6],
  "临安": [119.72, 30.23],
  "兰州": [103.73, 36.03],
  "沧州": [116.83, 38.33],
  "临沂": [118.35, 35.05],
  "南充": [106.110698, 30.837793],
  "天津": [117.2, 39.13],
  "富阳": [119.95, 30.07],
  "泰安": [117.13, 36.18],
  "诸暨": [120.23, 29.71],
  "郑州": [113.65, 34.76],
  "哈尔滨": [126.63, 45.75],
  "聊城": [115.97, 36.45],
  "芜湖": [118.38, 31.33],
  "唐山": [118.02, 39.63],
  "平顶山": [113.29, 33.75],
  "邢台": [114.48, 37.05],
  "德州": [116.29, 37.45],
  "济宁": [116.59, 35.38],
  "荆州": [112.239741, 30.335165],
  "宜昌": [111.3, 30.7],
  "义乌": [120.06, 29.32],
  "丽水": [119.92, 28.45],
  "洛阳": [112.44, 34.7],
  "秦皇岛": [119.57, 39.95],
  "株洲": [113.16, 27.83],
  "石家庄": [114.48, 38.03],
  "莱芜": [117.67, 36.19],
  "常德": [111.69, 29.05],
  "保定": [115.48, 38.85],
  "湘潭": [112.91, 27.87],
  "金华": [119.64, 29.12],
  "岳阳": [113.09, 29.37],
  "长沙": [113, 28.21],
  "衢州": [118.88, 28.97],
  "廊坊": [116.7, 39.53],
  "菏泽": [115.480656, 35.23375],
  "合肥": [117.27, 31.86],
  "武汉": [114.31, 30.52],
  "大庆": [125.03, 46.58],
  //北京
  "菜户营": [116.351727, 39.874498],
  "马连道": [116.333474, 39.889558],
  "天桥": [116.404476, 39.890554],
  "崇文门": [116.42661, 39.903508],
  "劲松": [116.472316, 39.891994],
  "甘家口": [116.337642, 39.927968],
  "五棵松": [116.2836, 39.91668],
  "白石桥": [116.331462, 39.952088],
  "中关村": [116.327437, 39.984934],
  "五道口": [116.343966, 39.998533],
  "亚运村": [116.419424, 40.002954],
  "望京": [116.471022, 40.003507],
  "芍药居": [116.441127, 39.989799],
  "国展": [116.448601, 39.967683],
  "朝阳门": [116.440552, 39.929849],
  "国贸": [116.470304, 39.915462],
  "王府井": [116.41813, 39.922435],
  "西单": [116.41813, 39.922435],
  "地安门": [116.401745, 39.94202],
  "西芦城": [116.299123, 39.758779],
  "良乡": [116.14447, 39.73903],
  "北大地": [116.289349, 39.860431],
  "岳各庄": [116.284318, 39.885018],
  "古城": [116.1942, 39.917565],
  "西山": [116.143464, 39.964918],
  "马连洼": [116.293661, 40.037433],
  "上地": [116.318095, 40.041742],
  "万泉河": [116.307243, 39.991402],
  "十三陵镇": [116.232217, 40.279011],
  "马坡": [116.664553, 40.177986],
  "大兴庄": [117.048597, 40.15163],
  "后栗园村": [116.904006, 40.411424],
  "南华园村": [116.640838, 40.31709],
  "旧县镇": [116.093662, 40.555526],
  "西马庄村": [116.63782, 39.922047],
  "长阳镇": [116.222731, 39.772478],
  "万柳": [116.057155, 39.982225],
  "世纪城": [116.291217, 39.96525],
  "西苑": [116.291217, 39.96525],
  "巴沟": [116.296392, 39.981064],
  "颐和园西门": [116.269083, 39.991734],
  "万安": [116.239475, 39.990241],
  "北宫门": [116.284678, 40.00942],
  "安河桥": [116.277204, 40.01887],
  "景泰陵": [116.24853, 40.009586],
  "玉峰桥": [116.242637, 40.004391],
  "香山": [116.210873, 39.999527],
  "北太平庄": [116.375227, 39.974264],
  "理工大学": [116.324634, 39.966522],
  "甜水园": [116.487623, 39.933777],
  "安贞": [116.410584, 39.974927], //
  "漆园村": [116.043213, 40.138614],
  "田庄": [115.906383, 40.086304],
  "雁翅镇": [115.836819, 40.024672],
  "杨村": [115.877638, 40.129347],
  "看丹村": [116.276342, 39.843426],
  "吕村": [116.178606, 39.833232],
  "公主坟": [116.194991, 39.810622],
  "北庄子": [116.16452, 39.852289],
  "郭庄子": [116.259956, 39.870843],
  "北大地": [116.289133, 39.860155],
  "大瓦窑": [116.247021, 39.86525],
  "园博园": [116.208502, 39.866856],
  "张郭庄": [116.193626, 39.864198],
  "赵辛店": [116.213316, 39.820321],
  "大富庄": [116.10322, 39.829852],
  "青龙湖镇": [116.088847, 39.786175],
  "苹果园": [116.193769, 39.934829],
  "白庙": [116.184858, 39.904504],
  "金安桥": [116.169407, 39.930015],
  "四道桥": [116.140518, 39.922213],
  "桥户营": [116.132325, 39.918506],
  "上岸": [116.128876, 39.911311],
  "栗园庄": [116.129882, 39.902013],
  "小圆": [116.121042, 39.896035],
  "石厂": [116.107173, 39.895481],
  "五里坨": [116.133619, 39.9616],
  "大峪村": [116.113209, 39.939144],
  "东龙门村": [116.093087, 39.950096],
  "崇化庄": [116.089781, 39.960162],
  "中门寺": [116.08432, 39.933611],
  "门头沟": [116.043788, 39.938812],
  "龙风坡": [116.058017, 39.934165],
  "三家店": [116.12787, 39.955074],
  "五道沟": [116.1306, 39.932505],
  "篱笆房": [116.196069, 39.7666],
  "广阳城": [116.19111, 39.754397],
  "下庄村": [116.131391, 39.728099],
  "白房子": [116.152663, 39.706342],
  "梨园桥": [116.108107, 39.705898],
  "大马村": [116.102933, 39.750958],
  "朱各庄": [116.000598, 39.743191],
  "东沙河": [116.014683, 39.70501],
  "大苑上村": [116.052628, 39.76183], //
  "枣园": [116.338935, 39.759057],
  "清源路": [116.339007, 39.748628],
  "黄村": [116.344397, 39.741083],
  "义和庄": [116.325712, 39.718165],
  "团河村": [116.391971, 39.751124],
  "孙村": [116.410225, 39.725268],
  "金星乡": [116.386941, 39.770537],
  "大庄村": [116.333761, 39.701179],
  "饮马井村": [116.345691, 39.723049],
  "天宫院": [116.327222, 39.675749],
  "新立村": [116.284247, 39.702734],
  "朝外": [116.451763, 39.928909],
  "呼家楼": [116.468795, 39.928521],
  "永安里": [116.457081, 39.914189],
  "建国门": [116.44242, 39.914632],
  "东单": [116.425963, 39.914411],
  "灯市口": [116.424239, 39.923818],
  "东四": [116.423951, 39.9309],
  "东直门": [116.447163, 39.943569],
  "三里屯": [116.45938, 39.942795],
  "团结湖": [116.470304, 39.937595],
  "左家庄": [116.454026, 39.960771],
  "石佛营": [116.509506, 39.938314],
  "十里堡": [116.511015, 39.92581],
  "亮马桥": [116.478245, 39.959001],
  "关帝庙": [116.571022, 39.978631],
  "果园": [116.653163, 39.899799],
  "北运河": [116.694413, 39.908987],
  "新华大街": [116.664302, 39.9143],
  "南关村": [116.68198, 39.897197],
  "土桥": [116.693263, 39.877599],
  "小圣庙村": [116.722871, 39.887731],
  "北关": [116.658768, 39.92664],
  "梨园": [116.670841, 39.881475],
  "西马各庄": [116.681607, 39.740225],
  "南法信": [116.617073, 40.134507],
  "胜利": [116.658323, 40.127004],
  "杨家营": [116.638991, 40.106976],
  "衙门村": [116.61427, 40.161586],
  "俸伯乡": [116.726953, 40.142064],
  "临河村": [116.691237, 40.090749],
  "北小营镇": [116.734643, 40.208548],
  "李遂镇": [116.761664, 40.094724],
  "后沙峪镇": [116.551245, 40.112383],
  "赵全营镇": [116.592064, 40.218686],
  "南邵镇": [116.292367, 40.213973],
  "北邵洼": [116.28784, 40.228077],
  "百善镇": [116.325209, 40.197057],
  "沙河镇": [116.28439, 40.146115],
  "长岭镇": [116.258519, 40.301245],
  "南口镇": [116.140661, 40.254127],
  "崔村镇": [116.364879, 40.22725],
  "流村镇": [116.065348, 40.191545],
  "八达岭镇": [115.992333, 40.37076],
  "北石槽镇": [116.543677, 40.254457],
  "井庄镇": [116.103292, 40.477862],
  "张山营镇": [115.850329, 40.481813],
  "康庄镇": [115.906671, 40.387358],
  "后城镇": [116.076271, 40.698331],
  "永宁镇": [116.178606, 40.537105],
  "怀北镇": [116.69258, 40.396151],
  "杨宋镇": [116.69718, 40.301135],
  "庙城镇": [116.640838, 40.298493],
  "桥梓镇": [116.571848, 40.297613],
  "琉璃庙镇": [116.615542, 40.59542],
  "渤海镇": [116.475262, 40.426914],
  "东邵渠镇": [116.976589, 40.304656],
  "石城镇": [116.82826, 40.548071],
  "太师屯镇": [117.131816, 40.548071],
  "大城子镇": [117.114568, 40.402304],
  "巨各庄镇": [116.957042, 40.384721],
  "大华山镇": [117.068575, 40.287927],
  "靠山集乡": [117.323838, 40.205102],
  "徒子峪乡": [117.322688, 40.314339],
  "马坊镇": [117.024882, 40.066539],
  "刘家店镇": [117.029481, 40.247188],
  "南窑乡": [115.839981, 39.774586],
  "长沟镇": [115.91012, 39.589782],
  "清水镇": [115.618063, 39.949156],
  "榆垈镇": [116.326359, 39.520352],
  "礼贤镇": [116.45399, 39.567537],
  "张家湾镇": [116.731675, 39.864142],
  "甘棠镇": [116.822511, 39.864585],
  // 河南
  '兰考': [114.385481, 34.825227],
  '郑州': [113.4668, 34.6234],
  '鹤壁': [114.306924, 35.752846],
  '新乡': [113.938978, 35.309189],
  '濮阳': [115.038216, 35.764093],
  '许昌': [113.860789, 34.040073],
  '漯河': [114.021765, 33.590883],
  '南阳': [112.531584, 33.019279],
  '商丘': [115.659125, 34.44116],
  '信阳': [114.095355, 32.146995],
  '周口': [114.693267, 33.644758],
  '驻马店': [114.030964, 33.034777],
  '济源': [112.623571, 35.078872],
  '管城回族区': [113.680617, 34.758191],
  '郑州大学': [113.647846, 34.748937],
  '郑州之林': [113.722298, 34.781912],
  '客运西站': [113.60329, 34.763173],
  '小郭村': [113.757368, 34.828861],
  '海洋馆': [113.665956, 34.826728],
  '石佛公社': [113.587193, 34.817245],
  '西流湖': [113.579144, 34.755344],
  '世纪欢乐园': [113.726897, 34.737547],
  '天然宝艺术馆': [113.635198, 34.720696],
  '商务厅': [113.674149, 34.771594],
  '未来大厦': [113.674149, 34.771594],
  '华润万象城': [113.668256, 34.761038], //
  '洛宁县': [111.655189, 34.398204],
  '西峡县': [111.489614, 33.319961],
  '宜阳县': [112.174913, 34.542959],
  '嵩县': [112.078327, 34.150012],
  '王屋镇': [112.277248, 35.122269],
  '大峪镇': [112.402579, 34.951086],
  '武涉县': [113.404082, 35.109041],
  '博爱县': [113.071781, 35.180823],
  '新乡县': [113.811122, 35.195927],
  '原阳县': [113.946803, 35.074072],
  '辉县市': [113.806523, 35.470133],
  '淇县': [114.222762, 35.629888],
  '滑县': [114.561962, 35.558508],
  '山城区': [114.185392, 35.891376],
  '林州市': [113.848492, 36.075488],
  '内黄县': [114.905187, 35.960585],
  '滑县': [114.54184, 35.555689],
  '南乐县': [115.200693, 36.095088],
  '濮阳县': [115.046616, 35.721835],
  '范县': [115.528395, 35.861896],
  '民权县': [115.159874, 34.64233],
  '睢县': [115.079386, 34.434893],
  '扶沟县': [114.398686, 34.049092],
  '太康县': [114.856319, 34.089284],
  '淮阳县': [114.872417, 33.755692],
  '项城市': [114.894263, 33.461274],
  '舞阳县': [113.647846, 33.44537],
  '临颍县': [113.942203, 33.818581],
  '鲁山县': [112.903906, 33.756652],
  '宝丰县': [113.07868, 33.879984],
  '叶县': [113.374762, 33.625446],
  '遂平县': [113.99797, 33.137793],
  '汝南县': [114.364766, 33.006124],
  '确山县': [114.037639, 32.802908],
  '沙河店镇': [113.74472, 33.001522],
  '罗山县': [114.532354, 32.192643],
  '光山县': [114.929046, 31.99491],
  '南召县': [112.44771, 33.481753],
  '镇平县': [112.24764, 33.023805],
  '新野县': [112.38102, 32.549809],
  '孟津县': [112.45231, 34.818193],
  '偃师市': [112.800708, 34.722358],
  '禹州市': [113.495206, 34.167935],
  '长葛市': [113.817159, 34.211891],
  '鄢陵县': [114.182805, 34.087609],
  '通许县': [114.481761, 34.473232],
  '兰考县': [114.810613, 34.805864],
  '杞县': [114.780717, 34.579821],
  '新郑市': [113.752769, 34.383667],
  '登封市': [113.036873, 34.470411], //
  '下坡杨村': [113.610333, 34.856117],
  '荥阳市': [113.541631, 34.884785],
  '宋庄村': [113.632324, 34.888338],
  '王岗': [113.679179, 34.877441],
  '皋寨村': [113.328723, 34.805262],
  '东马固': [113.278562, 34.825059],
  '金寨回族乡': [113.367674, 34.829682],
  '乔楼镇': [113.39067, 34.768976],
  '豫龙镇': [113.436089, 34.77799],
  '贾峪镇': [113.45736, 34.679732],
  '崔庙镇': [113.358475, 34.678307],
  '后牛庄村': [113.599068, 34.767382],
  '辛庄': [113.49199, 34.809834],
  '石庙': [113.487103, 34.76412],
  '李村': [113.572478, 34.730663],
  '杨沟': [113.59993, 34.698023],
  '七十四中学': [113.644055, 34.715116],
  '华润万象城': [113.668992, 34.761154],
  '祭城路街道': [113.772476, 34.788196],
  '中原福塔': [113.753504, 34.729832],
  '汇艺剧院': [113.778513, 34.760205],
  '官渡镇': [114.098597, 34.7398],
  '白沙镇': [113.899676, 34.736003],
  '万滩镇': [113.950269, 34.868792],
  '黄店镇': [114.01351, 34.557347],
  '新村镇': [113.719153, 34.444061],
  '龙湖镇': [113.690407, 34.615358],
  '辛店镇': [113.617968, 34.390696],
  '大马乡': [114.019259, 34.377349],
  '梨河镇': [113.73985, 34.357325],
  '袁庄乡': [113.386466, 34.574199],
  '刘寨镇': [113.550891, 34.503785],
  '超化镇': [113.415211, 34.459508],
  '大金店镇': [112.987718, 34.379652],
  '告成镇': [113.158467, 34.408725],
  '唐庄乡': [113.149844, 34.501118],
  '卢店镇': [113.161342, 34.465888],
  '芝田镇': [112.954264, 34.698797],
  '北山口镇': [113.010606, 34.733928],
  '站街镇': [113.067522, 34.795609],
  '康店镇': [112.954264, 34.762402],
  '西村镇': [112.971511, 34.650823],
  '花胡庄村': [113.748941, 34.812563],
  '中医院': [113.655733, 34.806398],
};

var chinaCity = [{
    "name": "海门",
    value: 90
  },
  {
    "name": "鄂尔多斯",
    value: 120
  },
  {
    "name": "招远",
    value: 1205
  },
  {
    "name": "舟山",
    value: 1203
  },
  {
    "name": "齐齐哈尔",
    value: 140
  },
  {
    "name": "盐城",
    value: 1510
  },
  {
    "name": "赤峰",
    value: 160
  },
  {
    "name": "青岛",
    value: 1804
  },
  {
    "name": "乳山",
    value: 180
  },
  {
    "name": "金昌",
    value: 190
  },
  {
    "name": "泉州",
    value: 210
  },
  {
    "name": "莱西",
    value: 2105
  },
  {
    "name": "日照",
    value: 210
  },
  {
    "name": "胶南",
    value: 220
  },
  {
    "name": "南通",
    value: 2306
  },
  {
    "name": "拉萨",
    value: 240
  },
  {
    "name": "云浮",
    value: 240
  },
  {
    "name": "梅州",
    value: 2570
  },
  {
    "name": "文登",
    value: 250
  },
  {
    "name": "上海",
    value: 2540
  },
  {
    "name": "攀枝花",
    value: 2520
  },
  {
    "name": "威海",
    value: 250
  },
  {
    "name": "承德",
    value: 2510
  },
  {
    "name": "厦门",
    value: 2660
  },
  {
    "name": "汕尾",
    value: 26
  },
  {
    "name": "潮州",
    value: 260
  },
  {
    "name": "丹东",
    value: 27
  },
  {
    "name": "太仓",
    value: 270
  },
  {
    "name": "曲靖",
    value: 27
  },
  {
    "name": "烟台",
    value: 280
  },
  {
    "name": "福州",
    value: 290
  },
  {
    "name": "瓦房店",
    value: 300
  },
  {
    "name": "即墨",
    value: 300
  },
  {
    "name": "抚顺",
    value: 310
  },
  {
    "name": "玉溪",
    value: 31
  },
  {
    "name": "张家口",
    value: 310
  },
  {
    "name": "阳泉",
    value: 310
  },
  {
    "name": "莱州",
    value: 320
  },
  {
    "name": "湖州",
    value: 320
  },
  {
    "name": "汕头",
    value: 320
  },
  {
    "name": "昆山",
    value: 330
  },
  {
    "name": "宁波",
    value: 330
  },
  {
    "name": "湛江",
    value: 330
  },
  {
    "name": "揭阳",
    value: 340
  },
  {
    "name": "荣成",
    value: 340
  },
  {
    "name": "连云港",
    value: 350
  },
  {
    "name": "葫芦岛",
    value: 350
  },
  {
    "name": "常熟",
    value: 360
  },
  {
    "name": "东莞",
    value: 360
  },
  {
    "name": "河源",
    value: 306
  },
  {
    "name": "淮安",
    value: 306
  },
  {
    "name": "泰州",
    value: 306
  },
  {
    "name": "南宁",
    value: 307
  },
  {
    "name": "营口",
    value: 370
  },
  {
    "name": "惠州",
    value: 370
  },
  {
    "name": "江阴",
    value: 37
  },
  {
    "name": "蓬莱",
    value: 370
  },
  {
    "name": "韶关",
    value: 380
  },
  {
    "name": "嘉峪关",
    value: 308
  },
  {
    "name": "广州",
    value: 308
  },
  {
    "name": "延安",
    value: 380
  },
  {
    "name": "太原",
    value: 309
  },
  {
    "name": "清远",
    value: 309
  },
  {
    "name": "中山",
    value: 390
  },
  {
    "name": "昆明",
    value: 390
  },
  {
    "name": "寿光",
    value: 400
  },
  {
    "name": "盘锦",
    value: 400
  },
  {
    "name": "长治",
    value: 410
  },
  {
    "name": "深圳",
    value: 410
  },
  {
    "name": "珠海",
    value: 420
  },
  {
    "name": "宿迁",
    value: 430
  },
  {
    "name": "咸阳",
    value: 430
  },
  {
    "name": "铜川",
    value: 440
  },
  {
    "name": "平度",
    value: 440
  },
  {
    "name": "佛山",
    value: 440
  },
  {
    "name": "海口",
    value: 440
  },
  {
    "name": "江门",
    value: 450
  },
  {
    "name": "章丘",
    value: 450
  },
  {
    "name": "肇庆",
    value: 460
  },
  {
    "name": "大连",
    value: 470
  },
  {
    "name": "临汾",
    value: 470
  },
  {
    "name": "吴江",
    value: 470
  },
  {
    "name": "石嘴山",
    value: 490
  },
  {
    "name": "沈阳",
    value: 500
  },
  {
    "name": "苏州",
    value: 500
  },
  {
    "name": "茂名",
    value: 500
  },
  {
    "name": "嘉兴",
    value: 510
  },
  {
    "name": "长春",
    value: 510
  },
  {
    "name": "胶州",
    value: 520
  },
  {
    "name": "银川",
    value: 520
  },
  {
    "name": "张家港",
    value: 520
  },
  {
    "name": "三门峡",
    value: 530
  },
  {
    "name": "锦州",
    value: 540
  },
  {
    "name": "南昌",
    value: 540
  },
  {
    "name": "柳州",
    value: 540
  },
  {
    "name": "三亚",
    value: 540
  },
  {
    "name": "自贡",
    value: 560
  },
  {
    "name": "吉林",
    value: 560
  },
  {
    "name": "阳江",
    value: 570
  },
  {
    "name": "泸州",
    value: 570
  },
  {
    "name": "西宁",
    value: 570
  },
  {
    "name": "宜宾",
    value: 580
  },
  {
    "name": "呼和浩特",
    value: 580
  },
  {
    "name": "成都",
    value: 580
  },
  {
    "name": "大同",
    value: 580
  },
  {
    "name": "镇江",
    value: 590
  },
  {
    "name": "桂林",
    value: 590
  },
  {
    "name": "张家界",
    value: 590
  },
  {
    "name": "宜兴",
    value: 590
  },
  {
    "name": "北海",
    value: 600
  },
  {
    "name": "西安",
    value: 610
  },
  {
    "name": "金坛",
    value: 620
  },
  {
    "name": "东营",
    value: 620
  },
  {
    "name": "牡丹江",
    value: 630
  },
  {
    "name": "遵义",
    value: 630
  },
  {
    "name": "绍兴",
    value: 630
  },
  {
    "name": "扬州",
    value: 644
  },
  {
    "name": "常州",
    value: 644
  },
  {
    "name": "潍坊",
    value: 655
  },
  {
    "name": "重庆",
    value: 626
  },
  {
    "name": "台州",
    value: 676
  },
  {
    "name": "南京",
    value: 617
  },
  {
    "name": "滨州",
    value: 170
  },
  {
    "name": "贵阳",
    value: 731
  },
  {
    "name": "无锡",
    value: 714
  },
  {
    "name": "本溪",
    value: 721
  },
  {
    "name": "克拉玛依",
    value: 712
  },
  {
    "name": "渭南",
    value: 742
  },
  {
    "name": "马鞍山",
    value: 762
  },
  {
    "name": "宝鸡",
    value: 772
  },
  {
    "name": "焦作",
    value: 745
  },
  {
    "name": "句容",
    value: 745
  },
  {
    "name": "北京",
    value: 739
  },
  {
    "name": "徐州",
    value: 729
  },
  {
    "name": "衡水",
    value: 850
  },
  {
    "name": "包头",
    value: 860
  },
  {
    "name": "绵阳",
    value: 820
  },
  {
    "name": "乌鲁木齐",
    value: 814
  },
  {
    "name": "枣庄",
    value: 834
  },
  {
    "name": "杭州",
    value: 844
  },
  {
    "name": "淄博",
    value: 865
  },
  {
    "name": "鞍山",
    value: 826
  },
  {
    "name": "溧阳",
    value: 865
  },
  {
    "name": "库尔勒",
    value: 826
  },
  {
    "name": "安阳",
    value: 950
  },
  {
    "name": "开封",
    value: 960
  },
  {
    "name": "济南",
    value: 932
  },
  {
    "name": "德阳",
    value: 923
  },
  {
    "name": "温州",
    value: 945
  },
  {
    "name": "九江",
    value: 956
  },
  {
    "name": "邯郸",
    value: 985
  },
  {
    "name": "临安",
    value: 959
  },
  {
    "name": "兰州",
    value: 949
  },
  {
    "name": "沧州",
    value: 1020
  },
  {
    "name": "临沂",
    value: 1023
  },
  {
    "name": "南充",
    value: 1014
  },
  {
    "name": "天津",
    value: 1015
  },
  {
    "name": "富阳",
    value: 1046
  },
  {
    "name": "泰安",
    value: 1142
  },
  {
    "name": "诸暨",
    value: 1152
  },
  {
    "name": "郑州",
    value: 1123
  },
  {
    "name": "哈尔滨",
    value: 1614
  },
  {
    "name": "聊城",
    value: 1216
  },
  {
    "name": "芜湖",
    value: 1176
  },
  {
    "name": "唐山",
    value: 1129
  },
  {
    "name": "平顶山",
    value: 1159
  },
  {
    "name": "邢台",
    value: 1219
  },
  {
    "name": "德州",
    value: 1520
  },
  {
    "name": "济宁",
    value: 1220
  },
  {
    "name": "荆州",
    value: 1247
  },
  {
    "name": "宜昌",
    value: 1350
  },
  {
    "name": "义乌",
    value: 1362
  },
  {
    "name": "丽水",
    value: 1333
  },
  {
    "name": "洛阳",
    value: 1324
  },
  {
    "name": "秦皇岛",
    value: 1316
  },
  {
    "name": "株洲",
    value: 1453
  },
  {
    "name": "石家庄",
    value: 1472
  },
  {
    "name": "莱芜",
    value: 1418
  },
  {
    "name": "常德",
    value: 1542
  },
  {
    "name": "保定",
    value: 1531
  },
  {
    "name": "湘潭",
    value: 1546
  },
  {
    "name": "金华",
    value: 1577
  },
  {
    "name": "岳阳",
    value: 1689
  },
  {
    "name": "长沙",
    value: 1795
  },
  {
    "name": "衢州",
    value: 1778
  },
  {
    "name": "廊坊",
    value: 1938
  },
  {
    "name": "菏泽",
    value: 1394
  },
  {
    "name": "合肥",
    value: 2297
  },
  {
    "name": "武汉",
    value: 2734
  },
  {
    "name": "大庆",
    value: 2793
  },
  //北京
  {
    "name": "菜户营",
    value: 2362
  },
  {
    "name": "马连道",
    value: 2333
  },
  {
    "name": "天桥",
    value: 2324
  },
  {
    "name": "崇文门",
    value: 2316
  },
  {
    "name": "劲松",
    value: 2453
  },
  {
    "name": "甘家口",
    value: 1472
  },
  {
    "name": "五棵松",
    value: 1418
  },
  {
    "name": "白石桥",
    value: 542
  },
  {
    "name": "中关村",
    value: 2531
  },
  {
    "name": "五道口",
    value: 1546
  },
  {
    "name": "亚运村",
    value: 2577
  },
  {
    "name": "望京",
    value: 1689
  },
  {
    "name": "芍药居",
    value: 1795
  },
  {
    "name": "国展",
    value: 778
  },
  {
    "name": "朝阳门",
    value: 1938
  },
  {
    "name": "国贸",
    value: 2394
  },
  {
    "name": "王府井",
    value: 2297
  },
  {
    "name": "西单",
    value: 1734
  },
  {
    "name": "地安门",
    value: 1793
  },
  {
    "name": "西芦城",
    value: 1362
  },
  {
    "name": "良乡",
    value: 1333
  },
  {
    "name": "北大地",
    value: 1324
  },
  {
    "name": "岳各庄",
    value: 1316
  },
  {
    "name": "古城",
    value: 1453
  },
  {
    "name": "西山",
    value: 1472
  },
  {
    "name": "马连洼",
    value: 1418
  },
  {
    "name": "上地",
    value: 1542
  },
  {
    "name": "万泉河",
    value: 1531
  },
  {
    "name": "十三陵镇",
    value: 1546
  },
  {
    "name": "马坡",
    value: 1577
  },
  {
    "name": "大兴庄",
    value: 1689
  },
  {
    "name": "后栗园村",
    value: 795
  },
  {
    "name": "南华园村",
    value: 778
  },
  {
    "name": "旧县镇",
    value: 938
  },
  {
    "name": "西马庄村",
    value: 1394
  },
  {
    "name": "长阳镇",
    value: 2297
  },
  {
    "name": "妙峰山镇",
    value: 2734
  },
  {
    "name": "万柳",
    value: 2134
  },
  {
    "name": "世纪城",
    value: 2234
  },
  {
    "name": "西苑",
    value: 2334
  },
  {
    "name": "巴沟",
    value: 2434
  },
  {
    "name": "颐和园西门",
    value: 2134
  },
  {
    "name": "万安",
    value: 2234
  },
  {
    "name": "北宫门",
    value: 2334
  },
  {
    "name": "安河桥",
    value: 2434
  },
  {
    "name": "景泰陵",
    value: 2134
  },
  {
    "name": "玉峰桥",
    value: 2234
  },
  {
    "name": "香山",
    value: 2334
  },
  {
    "name": "北太平庄",
    value: 2434
  },
  {
    "name": "理工大学",
    value: 2134
  },
  {
    "name": "甜水园",
    value: 2234
  },
  {
    "name": "安贞",
    value: 2334
  },
  {
    "name": "漆园村",
    value: 2434
  },
  {
    "name": "田庄",
    value: 2134
  },
  {
    "name": "雁翅镇",
    value: 2234
  },
  {
    "name": "杨村",
    value: 2534
  },
  {
    "name": "看丹村",
    value: 2634
  },
  {
    "name": "吕村",
    value: 2134
  },
  {
    "name": "公主坟",
    value: 2234
  },
  {
    "name": "北庄子",
    value: 2234
  },
  {
    "name": "郭庄子",
    value: 2434
  },
  {
    "name": "北大地",
    value: 2534
  },
  {
    "name": "大瓦窑",
    value: 2634
  },
  {
    "name": "园博园",
    value: 2134
  },
  {
    "name": "张郭庄",
    value: 2234
  },
  {
    "name": "赵辛店",
    value: 2334
  },
  {
    "name": "大富庄",
    value: 2434
  },
  {
    "name": "青龙湖镇",
    value: 2534
  },
  {
    "name": "苹果园",
    value: 2634
  },
  {
    "name": "白庙",
    value: 2134
  },
  {
    "name": "金安桥",
    value: 2734
  },
  {
    "name": "四道桥",
    value: 2134
  },
  {
    "name": "桥户营",
    value: 2234
  },
  {
    "name": "上岸",
    value: 2334
  },
  {
    "name": "栗园庄",
    value: 2434
  },
  {
    "name": "小圆",
    value: 2134
  },
  {
    "name": "石厂",
    value: 2234
  },
  {
    "name": "五里坨",
    value: 2334
  },
  {
    "name": "大峪村",
    value: 2434
  },
  {
    "name": "东龙门村",
    value: 2534
  },
  {
    "name": "崇化庄",
    value: 2134
  },
  {
    "name": "中门寺",
    value: 2734
  },
  {
    "name": "门头沟",
    value: 2234
  },
  {
    "name": "龙风坡",
    value: 2734
  },
  {
    "name": "三家店",
    value: 2434
  },
  {
    "name": "五道沟",
    value: 2334
  },
  {
    "name": "篱笆房",
    value: 2134
  },
  {
    "name": "广阳城",
    value: 2734
  },
  {
    "name": "下庄村",
    value: 2234
  },
  {
    "name": "白房子",
    value: 2734
  },
  {
    "name": "梨园桥",
    value: 2434
  },
  {
    "name": "大马村",
    value: 2334
  },
  {
    "name": "朱各庄",
    value: 2734
  },
  {
    "name": "东沙河",
    value: 2234
  },
  {
    "name": "大苑上",
    value: 2734
  },
  {
    "name": "坨里镇",
    value: 2434
  },
  {
    "name": "枣园",
    value: 2334
  },
  {
    "name": "清源路",
    value: 2734
  },
  {
    "name": "黄村",
    value: 2234
  },
  {
    "name": "义和庄",
    value: 2734
  },
  {
    "name": "团河村",
    value: 2434
  },
  {
    "name": "孙村",
    value: 2334
  },
  {
    "name": "金星乡",
    value: 2734
  },
  {
    "name": "大庄村",
    value: 2234
  },
  {
    "name": "饮马井村",
    value: 2734
  },
  {
    "name": "天宫院",
    value: 2434
  },
  {
    "name": "朝外",
    value: 2434
  },
  {
    "name": "呼家楼",
    value: 2434
  },
  {
    "name": "永安里",
    value: 2434
  },
  {
    "name": "建国门",
    value: 2434
  },
  {
    "name": "东单",
    value: 2434
  },
  {
    "name": "灯市口",
    value: 2434
  },
  {
    "name": "东四",
    value: 2434
  },
  {
    "name": "东直门",
    value: 2434
  },
  {
    "name": "三里屯",
    value: 2434
  },
  {
    "name": "团结湖",
    value: 2434
  },
  {
    "name": "左家庄",
    value: 2434
  },
  {
    "name": "石佛营",
    value: 2434
  },
  {
    "name": "十里堡",
    value: 2434
  },
  {
    "name": "亮马桥",
    value: 2434
  },
  {
    "name": "关帝庙",
    value: 1434
  },
  {
    "name": "果园",
    value: 1434
  },
  {
    "name": "北运河",
    value: 1434
  },
  {
    "name": "新华大街",
    value: 1434
  },
  {
    "name": "南关村",
    value: 1434
  },
  {
    "name": "土桥",
    value: 1434
  },
  {
    "name": "小圣庙村",
    value: 1434
  },
  {
    "name": "北关",
    value: 1434
  },
  {
    "name": "梨园",
    value: 1434
  },
  {
    "name": "西马各庄",
    value: 834
  },
  {
    "name": "南法信",
    value: 1834
  },
  {
    "name": "胜利",
    value: 834
  },
  {
    "name": "杨家营",
    value: 1834
  },
  {
    "name": "衙门村",
    value: 1834
  },
  {
    "name": "俸伯乡",
    value: 1834
  },
  {
    "name": "临河村",
    value: 1834
  },
  {
    "name": "北小营镇",
    value: 834
  },
  {
    "name": "李遂镇",
    value: 1834
  },
  {
    "name": "后沙峪镇",
    value: 834
  },
  {
    "name": "赵全营镇",
    value: 1134
  },
  {
    "name": "南邵镇",
    value: 2134
  },
  {
    "name": "北邵洼",
    value: 1134
  },
  {
    "name": "百善镇",
    value: 1134
  },
  {
    "name": "沙河镇",
    value: 2134
  },
  {
    "name": "长岭镇",
    value: 1134
  },
  {
    "name": "南口镇",
    value: 1134
  },
  {
    "name": "崔村镇",
    value: 1134
  },
  {
    "name": "流村镇",
    value: 1134
  },
  {
    "name": "八达岭镇",
    value: 1134
  },
  {
    "name": "北石槽镇",
    value: 1134
  },
  {
    "name": "井庄镇",
    value: 1834
  },
  {
    "name": "张山营镇",
    value: 1134
  },
  {
    "name": "康庄镇",
    value: 1134
  },
  {
    "name": "后城镇",
    value: 1134
  },
  {
    "name": "永宁镇",
    value: 1134
  },
  {
    "name": "怀北镇",
    value: 1134
  },
  {
    "name": "杨宋镇",
    value: 1134
  },
  {
    "name": "庙城镇",
    value: 1134
  },
  {
    "name": "桥梓镇",
    value: 1134
  },
  {
    "name": "琉璃庙镇",
    value: 1134
  },
  {
    "name": "渤海镇",
    value: 1134
  },
  {
    "name": "东邵渠镇",
    value: 1134
  },
  {
    "name": "石城镇",
    value: 1134
  },
  {
    "name": "太师屯镇",
    value: 1134
  },
  {
    "name": "大城子镇",
    value: 1134
  },
  {
    "name": "巨各庄镇",
    value: 1134
  },
  {
    "name": "大华山镇",
    value: 1134
  },
  {
    "name": "靠山集乡",
    value: 1134
  },
  {
    "name": "徒子峪乡",
    value: 1134
  },
  {
    "name": "马坊镇",
    value: 1134
  },
  {
    "name": "刘家店镇",
    value: 1134
  },
  {
    "name": "南窑乡",
    value: 1134
  },
  {
    "name": "长沟镇",
    value: 1134
  },
  {
    "name": "清水镇",
    value: 1134
  },
  {
    "name": "榆垈镇",
    value: 1134
  },
  {
    "name": "礼贤镇",
    value: 1134
  },
  {
    "name": "张家湾镇",
    value: 1134
  },
  {
    "name": "甘棠镇",
    value: 1134
  },
  // 河南
  {
    "name": "兰考",
    value: 938
  },
  {
    "name": "郑州",
    value: 2734
  },
  {
    "name": "鹤壁",
    value: 1964
  },
  {
    "name": "新乡",
    value: 1333
  },
  {
    "name": "濮阳",
    value: 1964
  },
  {
    "name": "许昌",
    value: 2734
  },
  {
    "name": "漯河",
    value: 1333
  },
  {
    "name": "南阳",
    value: 2734
  },
  {
    "name": "商丘",
    value: 2734
  },
  {
    "name": "信阳",
    value: 1964
  },
  {
    "name": "周口",
    value: 2734
  },
  {
    "name": "驻马店",
    value: 1333
  },
  {
    "name": "济源",
    value: 1333
  },
  {
    "name": "管城回族区",
    value: 1333
  },
  {
    "name": "郑州大学",
    value: 1964
  },
  {
    "name": "郑州之林",
    value: 1333
  },
  {
    "name": "客运西站",
    value: 1964
  },
  {
    "name": "小郭村",
    value: 2734
  },
  {
    "name": "海洋馆",
    value: 1333
  },
  {
    "name": "石佛公社",
    value: 2734
  },
  {
    "name": "西流湖",
    value: 2734
  },
  {
    "name": "世纪欢乐园",
    value: 1964
  },
  {
    "name": "天然宝艺术馆",
    value: 2734
  },
  {
    "name": "商务厅",
    value: 1333
  },
  {
    "name": "未来大厦",
    value: 1333
  },
  {
    "name": "华润万象城",
    value: 1333
  },
  {
    "name": "洛宁县",
    value: 2734
  },
  {
    "name": "西峡县",
    value: 1333
  },
  {
    "name": "宜阳县",
    value: 2734
  },
  {
    "name": "嵩县",
    value: 2734
  },
  {
    "name": "王屋镇",
    value: 1964
  },
  {
    "name": "大峪镇",
    value: 2734
  },
  {
    "name": "武涉县",
    value: 1333
  },
  {
    "name": "博爱县",
    value: 1333
  },
  {
    "name": "新乡县",
    value: 1333
  },
  {
    "name": "原阳县",
    value: 2734
  },
  {
    "name": "辉县市",
    value: 1333
  },
  {
    "name": "淇县",
    value: 2734
  },
  {
    "name": "滑县",
    value: 2734
  },
  {
    "name": "山城区",
    value: 1964
  },
  {
    "name": "林州市",
    value: 2734
  },
  {
    "name": "内黄县",
    value: 1333
  },
  {
    "name": "滑县",
    value: 1333
  },
  {
    "name": "南乐县",
    value: 1333
  },
  {
    "name": "濮阳县",
    value: 2734
  },
  {
    "name": "范县",
    value: 1333
  },
  {
    "name": "民权县",
    value: 2734
  },
  {
    "name": "睢县",
    value: 2734
  },
  {
    "name": "扶沟县",
    value: 1964
  },
  {
    "name": "太康县",
    value: 2734
  },
  {
    "name": "淮阳县",
    value: 1333
  },
  {
    "name": "项城市",
    value: 1333
  },
  {
    "name": "舞阳县",
    value: 1333
  },
  {
    "name": "临颍县",
    value: 2734
  },
  {
    "name": "鲁山县",
    value: 1333
  },
  {
    "name": "宝丰县",
    value: 2734
  },
  {
    "name": "叶县",
    value: 2734
  },
  {
    "name": "遂平县",
    value: 1964
  },
  {
    "name": "汝南县",
    value: 2734
  },
  {
    "name": "确山县",
    value: 1333
  },
  {
    "name": "沙河店镇",
    value: 1333
  },
  {
    "name": "罗山县",
    value: 1333
  },
  {
    "name": "光山县",
    value: 2734
  },
  {
    "name": "南召县",
    value: 1333
  },
  {
    "name": "镇平县",
    value: 2734
  },
  {
    "name": "新野县",
    value: 2734
  },
  {
    "name": "孟津县",
    value: 1964
  },
  {
    "name": "偃师市",
    value: 2734
  },
  {
    "name": "禹州市",
    value: 1333
  },
  {
    "name": "长葛市",
    value: 1333
  },
  {
    "name": "鄢陵县",
    value: 1333
  },
  {
    "name": "通许县",
    value: 2734
  },
  {
    "name": "兰考县",
    value: 1333
  },
  {
    "name": "杞县",
    value: 1333
  },
  {
    "name": "新郑市",
    value: 1333
  },
  {
    "name": "登封市",
    value: 1333
  },
  {
    "name": "下坡杨村",
    value: 1333
  },
  {
    "name": "荥阳市",
    value: 2734
  },
  {
    "name": "宋庄村",
    value: 1333
  },
  {
    "name": "王岗",
    value: 2734
  },
  {
    "name": "皋寨村",
    value: 2734
  },
  {
    "name": "东马固",
    value: 1964
  },
  {
    "name": "金寨回族乡",
    value: 2734
  },
  {
    "name": "乔楼镇",
    value: 1333
  },
  {
    "name": "豫龙镇",
    value: 1333
  },
  {
    "name": "贾峪镇",
    value: 1333
  },
  {
    "name": "崔庙镇",
    value: 2734
  },
  {
    "name": "后牛庄村",
    value: 1333
  },
  {
    "name": "辛庄",
    value: 1333
  },
  {
    "name": "石庙",
    value: 1333
  },
  {
    "name": "李村",
    value: 1333
  },
  {
    "name": "杨沟",
    value: 1333
  },
  {
    "name": "七十四中学",
    value: 2734
  },
  {
    "name": "华润万象城",
    value: 1333
  },
  {
    "name": "祭城路街道",
    value: 2734
  },
  {
    "name": "中原福塔",
    value: 2734
  },
  {
    "name": "汇艺剧院",
    value: 1964
  },
  {
    "name": "官渡镇",
    value: 2734
  },
  {
    "name": "白沙镇",
    value: 1333
  },
  {
    "name": "万滩镇",
    value: 1333
  },
  {
    "name": "黄店镇",
    value: 1333
  },
  {
    "name": "新村镇",
    value: 2734
  },
  {
    "name": "龙湖镇",
    value: 1333
  },
  {
    "name": "辛店镇",
    value: 1333
  },
  {
    "name": "大马乡",
    value: 1333
  },
  {
    "name": "梨河镇",
    value: 1333
  },
  {
    "name": "袁庄乡",
    value: 2734
  },
  {
    "name": "刘寨镇",
    value: 1333
  },
  {
    "name": "超化镇",
    value: 1333
  },
  {
    "name": "大金店镇",
    value: 1333
  },
  {
    "name": "告成镇",
    value: 1333
  },
  {
    "name": "唐庄乡",
    value: 2734
  },
  {
    "name": "卢店镇",
    value: 1333
  },
  {
    "name": "芝田镇",
    value: 1333
  },
  {
    "name": "北山口镇",
    value: 1333
  },
  {
    "name": "站街镇",
    value: 1333
  },
  {
    "name": "康店镇",
    value: 2734
  },
  {
    "name": "西村镇",
    value: 1333
  },
  {
    "name": "花胡庄村",
    value: 1333
  },
  {
    "name": "中医院",
    value: 1333
  },

];

var beijing = [{
    name: "菜户营",
    value: 2362
  },
  {
    name: "马连道",
    value: 2333
  },
  {
    name: "天桥",
    value: 2324
  },
  {
    name: "崇文门",
    value: 2316
  },
  {
    name: "劲松",
    value: 2453
  },
  {
    name: "甘家口",
    value: 1472
  },
  {
    name: "五棵松",
    value: 1418
  },
  {
    name: "白石桥",
    value: 542
  },
  {
    name: "中关村",
    value: 2531
  },
  {
    name: "五道口",
    value: 1546
  },
  {
    name: "亚运村",
    value: 2577
  },
  {
    name: "望京",
    value: 1689
  },
  {
    name: "芍药居",
    value: 1795
  },
  {
    name: "国展",
    value: 778
  },
  {
    name: "朝阳门",
    value: 1938
  },
  {
    name: "国贸",
    value: 2394
  },
  {
    name: "王府井",
    value: 2297
  },
  {
    name: "西单",
    value: 1734
  },
  {
    name: "地安门",
    value: 1793
  },
  {
    name: "西芦城",
    value: 1362
  },
  {
    name: "良乡",
    value: 1333
  },
  {
    name: "北大地",
    value: 1324
  },
  {
    name: "岳各庄",
    value: 1316
  },
  {
    name: "古城",
    value: 1453
  },
  {
    name: "西山",
    value: 1472
  },
  {
    name: "马连洼",
    value: 1418
  },
  {
    name: "上地",
    value: 1542
  },
  {
    name: "万泉河",
    value: 1531
  },
  {
    name: "十三陵镇",
    value: 1546
  },
  {
    name: "马坡",
    value: 1577
  },
  {
    name: "大兴庄",
    value: 1689
  },
  {
    name: "后栗园村",
    value: 795
  },
  {
    name: "南华园村",
    value: 778
  },
  {
    name: "旧县镇",
    value: 938
  },
  {
    name: "西马庄村",
    value: 1394
  },
  {
    name: "长阳镇",
    value: 2297
  },
  {
    name: "妙峰山镇",
    value: 2734
  },
  {
    name: "万柳",
    value: 2134
  },
  {
    name: "世纪城",
    value: 2234
  },
  {
    name: "西苑",
    value: 2334
  },
  {
    name: "巴沟",
    value: 2434
  },
  {
    name: "颐和园西门",
    value: 2134
  },
  {
    name: "万安",
    value: 2234
  },
  {
    name: "北宫门",
    value: 2334
  },
  {
    name: "安河桥",
    value: 2434
  },
  {
    name: "景泰陵",
    value: 2134
  },
  {
    name: "玉峰桥",
    value: 2234
  },
  {
    name: "香山",
    value: 2334
  },
  {
    name: "北太平庄",
    value: 2434
  },
  {
    name: "理工大学",
    value: 2134
  },
  {
    name: "甜水园",
    value: 2234
  },
  {
    name: "安贞",
    value: 2334
  },
  {
    name: "漆园村",
    value: 2434
  },
  {
    name: "田庄",
    value: 2134
  },
  {
    name: "雁翅镇",
    value: 2234
  },
  {
    name: "杨村",
    value: 2534
  },
  {
    name: "看丹村",
    value: 2634
  },
  {
    name: "吕村",
    value: 2134
  },
  {
    name: "公主坟",
    value: 2234
  },
  {
    name: "北庄子",
    value: 2234
  },
  {
    name: "郭庄子",
    value: 2434
  },
  {
    name: "北大地",
    value: 2534
  },
  {
    name: "大瓦窑",
    value: 2634
  },
  {
    name: "园博园",
    value: 2134
  },
  {
    name: "张郭庄",
    value: 2234
  },
  {
    name: "赵辛店",
    value: 2334
  },
  {
    name: "大富庄",
    value: 2434
  },
  {
    name: "青龙湖镇",
    value: 2534
  },
  {
    name: "苹果园",
    value: 2634
  },
  {
    name: "白庙",
    value: 2134
  },
  {
    name: "金安桥",
    value: 2734
  },
  {
    name: "四道桥",
    value: 2134
  },
  {
    name: "桥户营",
    value: 2234
  },
  {
    name: "上岸",
    value: 2334
  },
  {
    name: "栗园庄",
    value: 2434
  },
  {
    name: "小圆",
    value: 2134
  },
  {
    name: "石厂",
    value: 2234
  },
  {
    name: "五里坨",
    value: 2334
  },
  {
    name: "大峪村",
    value: 2434
  },
  {
    name: "东龙门村",
    value: 2534
  },
  {
    name: "崇化庄",
    value: 2134
  },
  {
    name: "中门寺",
    value: 2734
  },
  {
    name: "门头沟",
    value: 2234
  },
  {
    name: "龙风坡",
    value: 2734
  },
  {
    name: "三家店",
    value: 2434
  },
  {
    name: "五道沟",
    value: 2334
  },
  {
    name: "篱笆房",
    value: 2134
  },
  {
    name: "广阳城",
    value: 2734
  },
  {
    name: "下庄村",
    value: 2234
  },
  {
    name: "白房子",
    value: 2734
  },
  {
    name: "梨园桥",
    value: 2434
  },
  {
    name: "大马村",
    value: 2334
  },
  {
    name: "朱各庄",
    value: 2734
  },
  {
    name: "东沙河",
    value: 2234
  },
  {
    name: "大苑上",
    value: 2734
  },
  {
    name: "坨里镇",
    value: 2434
  },
  {
    name: "枣园",
    value: 2334
  },
  {
    name: "清源路",
    value: 2734
  },
  {
    name: "黄村",
    value: 2234
  },
  {
    name: "义和庄",
    value: 2734
  },
  {
    name: "团河村",
    value: 2434
  },
  {
    name: "孙村",
    value: 2334
  },
  {
    name: "金星乡",
    value: 2734
  },
  {
    name: "大庄村",
    value: 2234
  },
  {
    name: "饮马井村",
    value: 2734
  },
  {
    name: "天宫院",
    value: 2434
  },
  {
    name: "朝外",
    value: 2434
  },
  {
    name: "呼家楼",
    value: 2434
  },
  {
    name: "永安里",
    value: 2434
  },
  {
    name: "建国门",
    value: 2434
  },
  {
    name: "东单",
    value: 2434
  },
  {
    name: "灯市口",
    value: 2434
  },
  {
    name: "东四",
    value: 2434
  },
  {
    name: "东直门",
    value: 2434
  },
  {
    name: "三里屯",
    value: 2434
  },
  {
    name: "团结湖",
    value: 2434
  },
  {
    name: "左家庄",
    value: 2434
  },
  {
    name: "石佛营",
    value: 2434
  },
  {
    name: "十里堡",
    value: 2434
  },
  {
    name: "亮马桥",
    value: 2434
  },
  {
    name: "关帝庙",
    value: 1434
  },
  {
    name: "果园",
    value: 1434
  },
  {
    name: "北运河",
    value: 1434
  },
  {
    name: "新华大街",
    value: 1434
  },
  {
    name: "南关村",
    value: 1434
  },
  {
    name: "土桥",
    value: 1434
  },
  {
    name: "小圣庙村",
    value: 1434
  },
  {
    name: "北关",
    value: 1434
  },
  {
    name: "梨园",
    value: 1434
  },
  {
    name: "西马各庄",
    value: 834
  },
  {
    name: "南法信",
    value: 1834
  },
  {
    name: "胜利",
    value: 834
  },
  {
    name: "杨家营",
    value: 1834
  },
  {
    name: "衙门村",
    value: 1834
  },
  {
    name: "俸伯乡",
    value: 1834
  },
  {
    name: "临河村",
    value: 1834
  },
  {
    name: "北小营镇",
    value: 834
  },
  {
    name: "李遂镇",
    value: 1834
  },
  {
    name: "后沙峪镇",
    value: 834
  },
  {
    name: "赵全营镇",
    value: 1134
  },
  {
    name: "南邵镇",
    value: 2134
  },
  {
    name: "北邵洼",
    value: 1134
  },
  {
    name: "百善镇",
    value: 1134
  },
  {
    name: "沙河镇",
    value: 2134
  },
  {
    name: "长岭镇",
    value: 1134
  },
  {
    name: "南口镇",
    value: 1134
  },
  {
    name: "崔村镇",
    value: 1134
  },
  {
    name: "流村镇",
    value: 1134
  },
  {
    name: "八达岭镇",
    value: 2134
  },
  {
    name: "北石槽镇",
    value: 2134
  },
  {
    name: "井庄镇",
    value: 1834
  },
  {
    name: "张山营镇",
    value: 1134
  },
  {
    name: "康庄镇",
    value: 1134
  },
  {
    name: "后城镇",
    value: 1134
  },
  {
    name: "永宁镇",
    value: 1134
  },
  {
    name: "怀北镇",
    value: 1134
  },
  {
    name: "杨宋镇",
    value: 1134
  },
  {
    name: "庙城镇",
    value: 1134
  },
  {
    name: "桥梓镇",
    value: 1134
  },
  {
    name: "琉璃庙镇",
    value: 1134
  },
  {
    name: "渤海镇",
    value: 1134
  },
  {
    name: "东邵渠镇",
    value: 1134
  },
  {
    name: "石城镇",
    value: 1134
  },
  {
    name: "太师屯镇",
    value: 1134
  },
  {
    name: "大城子镇",
    value: 1134
  },
  {
    name: "巨各庄镇",
    value: 1134
  },
  {
    name: "大华山镇",
    value: 1134
  },
  {
    name: "靠山集乡",
    value: 1134
  },
  {
    name: "徒子峪乡",
    value: 1134
  },
  {
    name: "马坊镇",
    value: 1134
  },
  {
    name: "刘家店镇",
    value: 1134
  },
  {
    name: "南窑乡",
    value: 1134
  },
  {
    name: "长沟镇",
    value: 1134
  },
  {
    name: "清水镇",
    value: 1134
  },
  {
    name: "榆垈镇",
    value: 1134
  },
  {
    name: "礼贤镇",
    value: 1134
  },
  {
    name: "张家湾镇",
    value: 1134
  },
  {
    name: "甘棠镇",
    value: 1134
  },
];

var henan = [{
    name: "平顶山",
    value: 2314
  },
  {
    name: "洛阳",
    value: 2314
  },
  {
    name: "焦作",
    value: 2314
  },
  {
    name: "安阳",
    value: 2314
  },
  {
    name: "开封",
    value: 2314
  },
  {
    name: "三门峡",
    value: 2314
  },
  {
    name: "兰考",
    value: 938
  },
  {
    name: "郑州",
    value: 2734
  },
  {
    name: "鹤壁",
    value: 1964
  },
  {
    name: "新乡",
    value: 1333
  },
  {
    name: "濮阳",
    value: 1964
  },
  {
    name: "许昌",
    value: 2734
  },
  {
    name: "漯河",
    value: 1333
  },
  {
    name: "南阳",
    value: 2734
  },
  {
    name: "商丘",
    value: 2734
  },
  {
    name: "信阳",
    value: 1964
  },
  {
    name: "周口",
    value: 2734
  },
  {
    name: "驻马店",
    value: 1333
  },
  {
    name: "济源",
    value: 1333
  },
  {
    name: "管城回族区",
    value: 1333
  },
  {
    name: "洛宁县",
    value: 2734
  },
  {
    name: "西峡县",
    value: 1333
  },
  {
    name: "宜阳县",
    value: 2734
  },
  {
    name: "嵩县",
    value: 2734
  },
  {
    name: "王屋镇",
    value: 1964
  },
  {
    name: "大峪镇",
    value: 2734
  },
  {
    name: "武涉县",
    value: 1333
  },
  {
    name: "博爱县",
    value: 1333
  },
  {
    name: "新乡县",
    value: 1333
  },
  {
    name: "原阳县",
    value: 2734
  },
  {
    name: "辉县市",
    value: 1333
  },
  {
    name: "淇县",
    value: 2734
  },
  {
    name: "滑县",
    value: 2734
  },
  {
    name: "山城区",
    value: 1964
  },
  {
    name: "林州市",
    value: 2734
  },
  {
    name: "内黄县",
    value: 1333
  },
  {
    name: "滑县",
    value: 1333
  },
  {
    name: "南乐县",
    value: 1333
  },
  {
    name: "濮阳县",
    value: 2734
  },
  {
    name: "范县",
    value: 1333
  },
  {
    name: "民权县",
    value: 2734
  },
  {
    name: "睢县",
    value: 2734
  },
  {
    name: "扶沟县",
    value: 1964
  },
  {
    name: "太康县",
    value: 2734
  },
  {
    name: "淮阳县",
    value: 1333
  },
  {
    name: "项城市",
    value: 1333
  },
  {
    name: "舞阳县",
    value: 1333
  },
  {
    name: "临颍县",
    value: 2734
  },
  {
    name: "鲁山县",
    value: 1333
  },
  {
    name: "宝丰县",
    value: 2734
  },
  {
    name: "叶县",
    value: 2734
  },
  {
    name: "遂平县",
    value: 1964
  },
  {
    name: "汝南县",
    value: 2734
  },
  {
    name: "确山县",
    value: 1333
  },
  {
    name: "沙河店镇",
    value: 1333
  },
  {
    name: "罗山县",
    value: 1333
  },
  {
    name: "光山县",
    value: 2734
  },
  {
    name: "南召县",
    value: 1333
  },
  {
    name: "镇平县",
    value: 2734
  },
  {
    name: "新野县",
    value: 2734
  },
  {
    name: "孟津县",
    value: 1964
  },
  {
    name: "偃师市",
    value: 2734
  },
  {
    name: "禹州市",
    value: 1333
  },
  {
    name: "长葛市",
    value: 1333
  },
  {
    name: "鄢陵县",
    value: 1333
  },
  {
    name: "通许县",
    value: 2734
  },
  {
    name: "兰考县",
    value: 1333
  },
  {
    name: "杞县",
    value: 1333
  },
  {
    name: "新郑市",
    value: 1333
  },
  {
    name: "登封市",
    value: 1333
  },
  //郑州
  {
    name: "郑州大学",
    value: 1964
  },
  {
    name: "郑州之林",
    value: 1333
  },
  {
    name: "客运西站",
    value: 1964
  },
  {
    name: "小郭村",
    value: 2734
  },
  {
    name: "海洋馆",
    value: 1333
  },
  {
    name: "石佛公社",
    value: 2734
  },
  {
    name: "西流湖",
    value: 2734
  },
  {
    name: "世纪欢乐园",
    value: 1964
  },
  {
    name: "天然宝艺术馆",
    value: 2734
  },
  {
    name: "商务厅",
    value: 1333
  },
  {
    name: "未来大厦",
    value: 1333
  },
  {
    name: "华润万象城",
    value: 1333
  },
  {
    name: "管城回族区",
    value: 1333
  },
  {
    name: "登封市",
    value: 1333
  },
  {
    name: "下坡杨村",
    value: 1333
  },
  {
    name: "荥阳市",
    value: 2734
  },
  {
    name: "宋庄村",
    value: 1333
  },
  {
    name: "王岗",
    value: 2734
  },
  {
    name: "皋寨村",
    value: 2734
  },
  {
    name: "东马固",
    value: 1964
  },
  {
    name: "金寨回族乡",
    value: 2734
  },
  {
    name: "乔楼镇",
    value: 1333
  },
  {
    name: "豫龙镇",
    value: 1333
  },
  {
    name: "贾峪镇",
    value: 1333
  },
  {
    name: "崔庙镇",
    value: 2734
  },
  {
    name: "后牛庄村",
    value: 1333
  },
  {
    name: "辛庄",
    value: 1333
  },
  {
    name: "石庙",
    value: 1333
  },
  {
    name: "李村",
    value: 1333
  },
  {
    name: "杨沟",
    value: 1333
  },
  {
    name: "七十四中学",
    value: 2734
  },
  {
    name: "华润万象城",
    value: 1333
  },
  {
    name: "祭城路街道",
    value: 2734
  },
  {
    name: "中原福塔",
    value: 2734
  },
  {
    name: "汇艺剧院",
    value: 1964
  },
  {
    name: "官渡镇",
    value: 2734
  },
  {
    name: "白沙镇",
    value: 1333
  },
  {
    name: "万滩镇",
    value: 1333
  },
  {
    name: "黄店镇",
    value: 1333
  },
  {
    name: "新村镇",
    value: 2734
  },
  {
    name: "龙湖镇",
    value: 1333
  },
  {
    name: "辛店镇",
    value: 1333
  },
  {
    name: "大马乡",
    value: 1333
  },
  {
    name: "梨河镇",
    value: 1333
  },
  {
    name: "袁庄乡",
    value: 2734
  },
  {
    name: "刘寨镇",
    value: 1333
  },
  {
    name: "超化镇",
    value: 1333
  },
  {
    name: "大金店镇",
    value: 1333
  },
  {
    name: "告成镇",
    value: 1333
  },
  {
    name: "唐庄乡",
    value: 2734
  },
  {
    name: "卢店镇",
    value: 1333
  },
  {
    name: "芝田镇",
    value: 1333
  },
  {
    name: "北山口镇",
    value: 1333
  },
  {
    name: "站街镇",
    value: 1333
  },
  {
    name: "康店镇",
    value: 2734
  },
  {
    name: "西村镇",
    value: 1333
  },
  {
    name: "花胡庄村",
    value: 1333
  },
  {
    name: "中医院",
    value: 1333
  },
];

var zhengzhou = [{
    name: "郑州大学",
    value: 1964
  },
  {
    name: "郑州之林",
    value: 1333
  },
  {
    name: "客运西站",
    value: 1964
  },
  {
    name: "小郭村",
    value: 2734
  },
  {
    name: "海洋馆",
    value: 1333
  },
  {
    name: "石佛公社",
    value: 2734
  },
  {
    name: "西流湖",
    value: 2734
  },
  {
    name: "世纪欢乐园",
    value: 1964
  },
  {
    name: "天然宝艺术馆",
    value: 2734
  },
  {
    name: "商务厅",
    value: 1333
  },
  {
    name: "未来大厦",
    value: 1333
  },
  {
    name: "华润万象城",
    value: 1333
  },
  {
    name: "登封市",
    value: 1333
  },
  {
    name: "下坡杨村",
    value: 1333
  },
  {
    name: "荥阳市",
    value: 2734
  },
  {
    name: "宋庄村",
    value: 1333
  },
  {
    name: "王岗",
    value: 2734
  },
  {
    name: "皋寨村",
    value: 2734
  },
  {
    name: "东马固",
    value: 1964
  },
  {
    name: "金寨回族乡",
    value: 2734
  },
  {
    name: "乔楼镇",
    value: 1333
  },
  {
    name: "豫龙镇",
    value: 1333
  },
  {
    name: "贾峪镇",
    value: 1333
  },
  {
    name: "崔庙镇",
    value: 2734
  },
  {
    name: "后牛庄村",
    value: 1333
  },
  {
    name: "辛庄",
    value: 1333
  },
  {
    name: "石庙",
    value: 1333
  },
  {
    name: "李村",
    value: 1333
  },
  {
    name: "杨沟",
    value: 1333
  },
  {
    name: "七十四中学",
    value: 2734
  },
  {
    name: "华润万象城",
    value: 1333
  },
  {
    name: "祭城路街道",
    value: 2734
  },
  {
    name: "中原福塔",
    value: 2734
  },
  {
    name: "汇艺剧院",
    value: 1964
  },
  {
    name: "官渡镇",
    value: 2734
  },
  {
    name: "白沙镇",
    value: 1333
  },
  {
    name: "万滩镇",
    value: 1333
  },
  {
    name: "黄店镇",
    value: 1333
  },
  {
    name: "新村镇",
    value: 2734
  },
  {
    name: "龙湖镇",
    value: 1333
  },
  {
    name: "辛店镇",
    value: 1333
  },
  {
    name: "大马乡",
    value: 1333
  },
  {
    name: "梨河镇",
    value: 1333
  },
  {
    name: "袁庄乡",
    value: 2734
  },
  {
    name: "刘寨镇",
    value: 1333
  },
  {
    name: "超化镇",
    value: 1333
  },
  {
    name: "大金店镇",
    value: 1333
  },
  {
    name: "告成镇",
    value: 1333
  },
  {
    name: "唐庄乡",
    value: 2734
  },
  {
    name: "卢店镇",
    value: 1333
  },
  {
    name: "芝田镇",
    value: 1333
  },
  {
    name: "北山口镇",
    value: 1333
  },
  {
    name: "站街镇",
    value: 1333
  },
  {
    name: "康店镇",
    value: 2734
  },
  {
    name: "西村镇",
    value: 1333
  },
  {
    name: "花胡庄村",
    value: 1333
  },
  {
    name: "中医院",
    value: 1333
  },
];
var allData = [{
    hallLng: "",
    hallLat: "",
    sendnum: "",
    hallName: ""
  }

]*/

// endregion 
// region 后台请求数据 
/* 请求后台数据 start */
function dataTime() {
  var d = new Date();
  var year = d.getFullYear();
  var month = d.getMonth() + 1; // 记得当前月是要+1的
  if (month < 10) {
    month = "0" + month;
  }
  var dt = d.getDate();
  if (dt < 10) {
    dt = "0" + dt;
  }
  var today = year + "-" + month + "-" + dt;
  //return today;
  //console.log(today);
  var datajson = {
  "queryDate": "2018-05-25" 
  };
  return datajson;
}
dataTime()
var allData;
var chinaCity = [];
$.ajax({
  type: 'post',
  async: false,
  //url: "http://10.162.26.182:10001/electronicFence/hallSendQuery",
  url: "http://10.162.26.182:10001/electronicFence/getHallMessage",
  data: {
    orderId:'74b2xsa20180523152239',
    hallId:'74b2xsa',
    queryDate:dataTime(),
    //queryDate:"2018-05-25",

  },
  // dataType: "json",
  success: function (result) {
    console.log(result);
    // allData = result.value;
    // for (var i = 0; i < result.value.length; i++) {
    //   var value = [];
    //   var v1 = parseFloat(result.value[i].hallLng)
    //   var v2 = parseFloat(result.value[i].hallLat)
    //   var v3 = parseFloat(result.value[i].sendnum)
    //   chinaCity.push({
    //     name: result.value[i].hallName,
    //     value: value.concat(v1, v2, v3)
    //   })
    // }
    // renderMap('china', d, chinaCity);
  },
  error: function () {
    console.log("请求失败")
  }
});
console.log(chinaCity);
console.log(allData);
/* 请求后台数据 end */
// endregion